# Cleanup

In [7]:
import pandas as pd

## Movies Metadata Table Preperation

In [2]:
movies_metadata = pd.read_csv('./data/movies_metadata.csv', low_memory=False)

In [3]:
movies_metadata[['id', 'title', 'release_date']]

           id                        title release_date
0         862                    Toy Story   1995-10-30
1        8844                      Jumanji   1995-12-15
2       15602             Grumpier Old Men   1995-12-22
3       31357            Waiting to Exhale   1995-12-22
4       11862  Father of the Bride Part II   1995-02-10
...       ...                          ...          ...
45461  439050                       Subdue          NaN
45462  111109          Century of Birthing   2011-11-17
45463   67758                     Betrayal   2003-08-01
45464  227506             Satan Triumphant   1917-10-21
45465  461257                     Queerama   2017-06-09

[45466 rows x 3 columns]

In [4]:
movies_metadata = movies_metadata.iloc[:10000]

In [5]:
movies_metadata.shape

(10000, 24)

In [6]:
movies_metadata[['id', 'title', 'release_date']]

         id                         title release_date
0       862                     Toy Story   1995-10-30
1      8844                       Jumanji   1995-12-15
2     15602              Grumpier Old Men   1995-12-22
3     31357             Waiting to Exhale   1995-12-22
4     11862   Father of the Bride Part II   1995-02-10
...     ...                           ...          ...
9995  43379              Miracle in Milan   1951-02-08
9996   9393               Before the Fall   2004-07-04
9997  16972                The Frisco Kid   1979-07-06
9998  21325  Onmyoji: The Yin Yang Master   2001-10-06
9999  13409              State Property 2   2005-04-13

[10000 rows x 3 columns]

In [9]:
movies_metadata.dropna(subset = ['release_date'], inplace=True)

In [10]:
movies_metadata[movies_metadata['release_date'].isnull()]

Empty DataFrame
Columns: [adult, belongs_to_collection, budget, genres, homepage, id, imdb_id, original_language, original_title, overview, popularity, poster_path, production_companies, production_countries, release_date, revenue, runtime, spoken_languages, status, tagline, title, video, vote_average, vote_count]
Index: []

[0 rows x 24 columns]

In [11]:
movies_metadata.to_csv('./data/clean_movies_metadata.csv', index=False)

## Credits Table Preperation

In [13]:
credits_df = pd.read_csv('./data/credits.csv')

In [16]:
credits_df[credits_df['id'].isnull()]

Empty DataFrame
Columns: [cast, crew, id]
Index: []

In [17]:
credits_df.to_csv('./data/clean_credits.csv', index=False)

## Keywords Table Preperation

In [18]:
keywords_df = pd.read_csv('./data/keywords.csv')

In [20]:
keywords_df[keywords_df['id'].isnull()]

Empty DataFrame
Columns: [id, keywords]
Index: []

In [19]:
keywords_df.to_csv('./data/clean_keywords.csv', index=False)